> 

databricks_mws_workspaces.test: Refreshing state... [id=5fe34970-bdbb-4353-bbfd-dabecca821e3/3769966105657340]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # databricks_mws_workspaces.test must be replaced
-/+ resource "databricks_mws_workspaces" "test" {
      ~ cloud                    = "gcp" -> (known after apply)
      ~ creation_time            = 1670948473232 -> (known after apply)
      - deployment_name          = "3769966105657340.0" -> null
      ~ id                       = "5fe34970-bdbb-4353-bbfd-dabecca821e3/3769966105657340" -> (known after apply)
      ~ pricing_tier             = "PREMIUM" -> (known after apply)
      ~ workspace_id             = 3769966105657340 -> (known after apply)
      ~ workspace_status         = "RUNNING" -> (known after apply)
      ~ workspace_status_message = "Workspace is running." -> (known after apply)
      ~ workspace_url            = "https://3769966105657340.0.gcp.databricks.com" -> (known after apply)
        # (4 unchanged attributes hidden)

      - network { # forces replacement
          - gcp_common_network_config {
              - gke_cluster_master_ip_range = "10.3.0.0/28" -> null
              - gke_connectivity_type       = "PRIVATE_NODE_PUBLIC_MASTER" -> null
            }

          - gcp_managed_network_config {
              - gke_cluster_pod_ip_range     = "10.1.0.0/16" -> null
              - gke_cluster_service_ip_range = "10.2.0.0/20" -> null
              - subnet_cidr                  = "10.0.0.0/16" -> null
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.